```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.example must be replaced
-/+ resource "aws_ecs_task_definition" "example" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:607754652120:task-definition/example:4" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - environment      = [] -> null
                    essential        = true
                    image            = "nginx:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/example"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "nginx"
                        }
                    }
                  - mountPoints      = [] -> null
                    name             = "example"
                  ~ portMappings     = [
                      ~ {
                            containerPort = 80
                          - hostPort      = 80 -> null
                            protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = [] -> null
                } # forces replacement,
            ]
        )
        cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::607754652120:role/ecs-task-execution" # forces replacement
        family                   = "example"
      ~ id                       = "example" -> (known after apply)
        memory                   = "512"
        network_mode             = "awsvpc"
        requires_compatibilities = [
            "FARGATE",
        ]
      ~ revision                 = 4 -> (known after apply)
      - tags                     = {} -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```